# Import libraries

In [8]:
# Usual libraries are imported here
import os
import yaml
import dask.dataframe as dd
import pandas as pd
import matplotlib
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [21]:
countries = pd.read_csv('C:/Users/59209/Desktop/date/catch_22_explor_and_vis-main/catch_22_explor_and_vis-main/data/countries.csv')
countries.info()
countries.head(4)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 226 entries, 0 to 225
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CODE       225 non-null    object
 1   NAME       226 non-null    object
 2   CODE3      226 non-null    object
 3   NUMCODE    226 non-null    int64
 4   PHONECODE  226 non-null    int64
dtypes: int64(2), object(3)
memory usage: 9.0+ KB

  CODE            NAME CODE3  NUMCODE  PHONECODE
0   AF     Afghanistan   AFG        4         93
1   AL         Albania   ALB        8        355
2   DZ         Algeria   DZA       12        213
3   AS  American Samoa   ASM       16       1684

In [23]:
currency_details = pd.read_csv('C:/Users/59209/Desktop/date/catch_22_explor_and_vis-main/catch_22_explor_and_vis-main/data/currency_details.csv')
currency_details.info()
currency_details.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 184 entries, 0 to 183
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CCY        184 non-null    object
 1   EXPONENT   184 non-null    int64
 2   IS_CRYPTO  184 non-null    bool
dtypes: bool(1), int64(1), object(1)
memory usage: 3.2+ KB

   CCY  EXPONENT  IS_CRYPTO
0  AED         2      False
1  AFN         2      False
2  ALL         2      False

In [24]:
fraudsters = pd.read_csv('C:/Users/59209/Desktop/date/catch_22_explor_and_vis-main/catch_22_explor_and_vis-main/data/fraudsters.csv')
fraudsters.info()
fraudsters.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 298 entries, 0 to 297
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   USER_ID  298 non-null    object
dtypes: object(1)
memory usage: 2.5+ KB

                                USER_ID
0  5270b0f4-2e4a-4ec9-8648-2135312ac1c4
1  848fc1b1-096c-40f7-b04a-1399c469e421
2  27c76eda-e159-4df3-845a-e13f4e28a8b5

In [25]:
german_credit_data = pd.read_csv('C:/Users/59209/Desktop/date/catch_22_explor_and_vis-main/catch_22_explor_and_vis-main/data/german_credit_data.csv')
german_credit_data.info()
german_credit_data.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        1000 non-null   int64
 1   Age               1000 non-null   int64
 2   Sex               1000 non-null   object
 3   Job               1000 non-null   int64
 4   Housing           1000 non-null   object
 5   Saving accounts   817 non-null    object
 6   Checking account  606 non-null    object
 7   Credit amount     1000 non-null   int64
 8   Duration          1000 non-null   int64
 9   Purpose           1000 non-null   object
dtypes: int64(5), object(5)
memory usage: 78.2+ KB

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education

In [27]:
users = pd.read_csv('C:/Users/59209/Desktop/date/catch_22_explor_and_vis-main/catch_22_explor_and_vis-main/data/users.csv')
users.info()
users.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9944 entries, 0 to 9943
Data columns (total 11 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ID                       9944 non-null   object
 1   HAS_EMAIL                9944 non-null   int64
 2   PHONE_COUNTRY            9944 non-null   object
 3   IS_FRAUDSTER             9944 non-null   bool
 4   TERMS_VERSION            8417 non-null   object
 5   CREATED_DATE             9944 non-null   object
 6   STATE                    9944 non-null   object
 7   COUNTRY                  9944 non-null   object
 8   BIRTH_YEAR               9944 non-null   int64
 9   KYC                      9944 non-null   object
 10  FAILED_SIGN_IN_ATTEMPTS  9944 non-null   int64
dtypes: bool(1), int64(3), object(7)
memory usage: 786.7+ KB

,ID,HAS_EMAIL,PHONE_COUNTRY,IS_FRAUDSTER,TERMS_VERSION,CREATED_DATE,STATE,COUNTRY,BIRTH_YEAR,KYC,FAILED_SIGN_IN_ATTEMPTS
0,1872820f-e3ac-4c02-bdc7-727897b60043,1,GB||JE||IM||GG,False,2018-05-25,2017-08-06 07:33:33.341000,ACTIVE,GB,1971,PASSED,0
1,545ff94d-66f8-4bea-b398-84425fb2301e,1,GB||JE||IM||GG,False,2018-01-01,2017-03-07 10:18:59.427000,ACTIVE,GB,1982,PASSED,0
2,10376f1a-a28a-4885-8daa-c8ca496026bb,1,ES,False,2018-09-20,2018-05-31 04:41:24.672000,ACTIVE,ES,1973,PASSED,0

Question

1.the number of transactions are in GBP

In [35]:
#import the date
date=pd.read_csv("C:/Users/59209/Desktop/date/catch_22_explor_and_vis-main/catch_22_explor_and_vis-main/data/transactions.csv")
date.info()
date.head(3)
CURRENCY=[row[0] for row in date.values.tolist()]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 688651 entries, 0 to 688650
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   CURRENCY           688651 non-null  object
 1   AMOUNT             688651 non-null  int64
 2   STATE              688651 non-null  object
 3   CREATED_DATE       688651 non-null  object
 4   MERCHANT_CATEGORY  223065 non-null  object
 5   MERCHANT_COUNTRY   483055 non-null  object
 6   ENTRY_METHOD       688651 non-null  object
 7   USER_ID            688651 non-null  object
 8   TYPE               688651 non-null  object
 9   SOURCE             688651 non-null  object
 10  ID                 688651 non-null  object
 11  AMOUNT_USD         688651 non-null  int64
dtypes: int64(2), object(10)
memory usage: 63.0+ MB

In [8]:
count_gbp=0
for i in CURRENCY:
    if i =='GBP':
        count_gbp+=1
print('the number of transactions are in GBP= ',count_gbp)

the number of transactions are in GBP=  339091

2.How many transactions are NOT in USD?

In [9]:
count_usd=0
for i in CURRENCY:
    if i!='USD':
        count_usd+=1
print('the number of transactions are not in USD=',count_usd)

the number of transactions are not in USD= 657110

3.What is the average and mediam transaction in USD?

In [10]:
#import the reansaction
transaction=[row[1] for row in date.values.tolist()]

In [19]:
USD_transaction=[]
for i in range(len(CURRENCY)):
    if CURRENCY[i]=='USD':
        USD_transaction.append(int(transaction[i]))
length=len(USD_transaction)
USD_average=sum(USD_transaction)/length
USD_transaction.sort()
if length%2==0:
    USD_mediam=0.5*(USD_transaction[int(length/2)]+USD_transaction[int(length/2+1)])
else:
    USD_mediam=USD_transaction[int(length/2)+1]
print('the average transaction in USD:','%.2f'%USD_average)
print('the mediam transaction in USD:',USD_mediam)

the average transaction in USD: 11598.75
the mediam transaction in USD: 2000.0

4.Construct a table showing the number of transactions in EACH currency

In [20]:
dict={}
for i in CURRENCY:
    if i not in dict:
        dict[i]=1
    else:
        dict[i]+=1

In [36]:
table = date[['CURRENCY', 'AMOUNT']].groupby('CURRENCY').count()
table

          AMOUNT
CURRENCY
AED          847
AUD         2110
BTC          283
CAD         1463
CHF         5761
CZK         1507
DKK         1711
ETH          197
EUR       264695
GBP       339091
HKD          480
HUF         1446
ILS          522
INR          207
JPY          733
LTC          137
MAD          115
NOK         2602
NZD          717
PLN        22362
QAR           28
RON         5837
SEK         1579
SGD          487
THB          690
TRY          338
USD        31542
XRP           38
ZAR         1126